Конфигурация/src/Documents/РегистрацияМаршрута/РегистрацияМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияМаршрута</name>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Вместимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокМаршрутов</name>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.Маршруты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтгрузкиКлиентам</name>
    <attributes>
      <name>ОтгрузкаКлиенту</name>
      <type>
        <types>DocumentRef.ОтгрузкаКлиенту</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/ОтгрузкаКлиенту/ОтгрузкаКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтгрузкаКлиенту</name>
  <registerRecords>AccumulationRegister.ОстаткиПродукции</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.ПродукцияИМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Catalogs/Маршруты/Маршруты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Маршруты</name>
  <tabularSections>
    <name>СписокКлиентов</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Район</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конфигурация/src/Documents/РегистрацияМаршрута/Forms/ФормаДокумента/Module.bsl
// При выборе машины подставляем её вместимость
&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Объект.Вместимость = ПолучитьВместимостьНаСервере(Объект.ТранспортноеСредство);
	Иначе
		Объект.Вместимость = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВместимостьНаСервере(ТсСсылка)
	Возврат ТсСсылка.Вместимость; 
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОтгрузки(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Сообщить("Выберите транспортное средство!");
		Возврат;
	КонецЕсли;
	
	Если Объект.СписокМаршрутов.Количество() = 0 Тогда
		Сообщить("Добавьте хотя бы один маршрут в список.");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуОтгрузокНаСервере();
	
	// Проверка на перегруз после заполнения
	ТекущийВес = Объект.ОтгрузкиКлиентам.Итог("Вес");
	Если ТекущийВес > Объект.Вместимость Тогда
		Разница = ТекущийВес - Объект.Вместимость;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Удалите некоторые отгрузки! Вес продукции (" + ТекущийВес + " кг) превышает вместимость (" + Объект.Вместимость + " кг) на " + Разница + " кг!";
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОтгрузокНаСервере()
	
	// Очищаем старые строки перед новым заполнением
	Объект.ОтгрузкиКлиентам.Очистить();
	
	// Нам нужен Запрос, который сделает следующее:
	// 1. Собирает все ссылки на Маршруты, выбранные в табличной части текущего документа.
	// 2. По этим Маршрутам собирает ВСЕХ Клиентов.
	// 3. Выбирает Отгрузки, которые еще НЕ зарегистрированы в других проведенных документах.
	// 4. Считает вес по каждой Отгрузке.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегМаршрутаМаршруты.Маршрут КАК Маршрут
		|ПОМЕСТИТЬ ВТ_ВыбранныеМаршруты
		|ИЗ
		|	&СписокМаршрутов КАК РегМаршрутаМаршруты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|// 1. Собираем всех клиентов, включенных в выбранные маршруты
		|ВЫБРАТЬ
		|	МаршрутыКлиенты.Клиент КАК Клиент
		|ПОМЕСТИТЬ ВТ_КлиентыМаршрутов
		|ИЗ
		|	Справочник.Маршруты.СписокКлиентов КАК МаршрутыКлиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВыбранныеМаршруты КАК ВТ_Маршруты
		|		ПО МаршрутыКлиенты.Ссылка = ВТ_Маршруты.Маршрут
		|
		|СГРУППИРОВАТЬ ПО
		|	МаршрутыКлиенты.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|// 2. Выбираем все отгрузки, которые уже заняты в ДРУГИХ проведенных регистрациях
		|ВЫБРАТЬ
		|	РегМаршрутаОтгрузки.ОтгрузкаКлиенту КАК Отгрузка
		|ПОМЕСТИТЬ ВТ_ЗанятыеОтгрузки
		|ИЗ
		|	Документ.РегистрацияМаршрута.ОтгрузкиКлиентам КАК РегМаршрутаОтгрузки
		|ГДЕ
		|	РегМаршрутаОтгрузки.Ссылка.Проведен = ИСТИНА
		|	И РегМаршрутаОтгрузки.Ссылка <> &ТекущийДокумент
		|
		|СГРУППИРОВАТЬ ПО
		|	РегМаршрутаОтгрузки.ОтгрузкаКлиенту
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|// 3. Выбираем данные из документов Отгрузка
		|ВЫБРАТЬ
		|	ОтгрузкаТЧ.Ссылка КАК Отгрузка,
		|	ОтгрузкаТЧ.Ссылка.Клиент КАК Клиент,
		|	СУММА(ОтгрузкаТЧ.Количество * ЕСТЬNULL(ОтгрузкаТЧ.Продукция.Вес, 0)) КАК Вес
		|ИЗ
		|	Документ.ОтгрузкаКлиенту.Продукция КАК ОтгрузкаТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлиентыМаршрутов КАК ВТ_Клиенты
		|		ПО ОтгрузкаТЧ.Ссылка.Клиент = ВТ_Клиенты.Клиент
		|ГДЕ
		|	ОтгрузкаТЧ.Ссылка.Проведен = ИСТИНА
		|	И НЕ ОтгрузкаТЧ.Ссылка В (ВЫБРАТЬ Т.Отгрузка ИЗ ВТ_ЗанятыеОтгрузки КАК Т)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтгрузкаТЧ.Ссылка,
		|	ОтгрузкаТЧ.Ссылка.Клиент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент";
	
	// Передаем параметры
	// Список маршрутов выгружаем из ТЧ документа в запрос
	Запрос.УстановитьПараметр("СписокМаршрутов", Объект.СписокМаршрутов.Выгрузить());
	Запрос.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.ОтгрузкиКлиентам.Добавить();
			НоваяСтрока.ОтгрузкаКлиенту = Выборка.Отгрузка;
			НоваяСтрока.Клиент = Выборка.Клиент;
			НоваяСтрока.Вес = Выборка.Вес;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьТаблицуОтгрузокНаСервере()
//	
//	Объект.ОтгрузкиКлиентам.Очистить();
//	
//	// ===================================================================
//	// ШАГ 1: Получаем выбранные маршруты из табличной части документа
//	// (Исправлено: Вызываем Выгрузить(), затем ВыгрузитьКолонку())
//	// ===================================================================
//	Если Объект.СписокМаршрутов.Количество() = 0 Тогда
//		Сообщить("В списке нет маршрутов. Заполнение прервано.");
//		Возврат;
//	КонецЕсли;
//	
//	// Правильный вызов: сначала Выгрузить() -> ТаблицаЗначений, затем ВыгрузитьКолонку()
//	ТаблицаМаршрутов = Объект.СписокМаршрутов.Выгрузить();
//	СписокМаршрутов = ТаблицаМаршрутов.ВыгрузитьКолонку("Маршрут");
//	
//	Сообщить("--- НАЧАЛО ОТЛАДКИ ---");
//	Сообщить("1. Маршруты, выбранные в документе: " + СписокМаршрутов.Количество());
//	
//	
//	// ===================================================================
//	// ШАГ 2: Получаем клиентов по выбранным маршрутам
//	// (Проверяем: Справочник.Маршруты.СписокКлиентов)
//	// ===================================================================
//	ЗапросКлиенты = Новый Запрос;
//	ЗапросКлиенты.Текст = 
//		"ВЫБРАТЬ
//		|	МаршрутыКлиенты.Клиент КАК Клиент
//		|ИЗ
//		|	Справочник.Маршруты.СписокКлиентов КАК МаршрутыКлиенты
//		|ГДЕ
//		|	МаршрутыКлиенты.Ссылка В(&СписокМаршрутов)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	МаршрутыКлиенты.Клиент";
//	
//	ЗапросКлиенты.УстановитьПараметр("СписокМаршрутов", СписокМаршрутов);
//	
//	// Выполнить().Выгрузить() возвращает ТаблицуЗначений, у которой есть ВыгрузитьКолонку()
//	РезультатКлиенты = ЗапросКлиенты.Выполнить().Выгрузить(); 
//	СписокКлиентов = РезультатКлиенты.ВыгрузитьКолонку("Клиент");
//	
//	Сообщить("2. Уникальные клиенты в выбранных маршрутах: " + СписокКлиентов.Количество());
//	
//	Если СписокКлиентов.Количество() = 0 Тогда
//		Сообщить("В справочниках 'Маршруты' не найдены клиенты по выбранным маршрутам. Заполнение прервано.");
//		Возврат;
//	КонецЕсли;
//	
//	
//	// ===================================================================
//	// ШАГ 3: Получаем отгрузки, которые УЖЕ заняты в других проведенных регистрациях
//	// (Проверяем: Документ.РегистрацияМаршрута.ОтгрузкиКлиентам.ОтгрузкаКлиенту)
//	// ===================================================================
//	ЗапросЗанятыеОтгрузки = Новый Запрос;
//	ЗапросЗанятыеОтгрузки.Текст = 
//		"ВЫБРАТЬ
//		|	РегМаршрутаОтгрузки.ОтгрузкаКлиенту КАК Отгрузка
//		|ИЗ
//		|	Документ.РегистрацияМаршрута.ОтгрузкиКлиентам КАК РегМаршрутаОтгрузки
//		|ГДЕ
//		|	РегМаршрутаОтгрузки.Ссылка.Проведен = ИСТИНА
//		|	И РегМаршрутаОтгрузки.Ссылка <> &ТекущийДокумент
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	РегМаршрутаОтгрузки.ОтгрузкаКлиенту";
//		
//	ЗапросЗанятыеОтгрузки.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);
//	
//	// Выполнить().Выгрузить() возвращает ТаблицуЗначений, у которой есть ВыгрузитьКолонку()
//	РезультатЗанятые = ЗапросЗанятыеОтгрузки.Выполнить().Выгрузить();
//	СписокЗанятыхОтгрузок = РезультатЗанятые.ВыгрузитьКолонку("Отгрузка");
//	
//	Сообщить("3. Отгрузки, занятые в других ПРОВЕДЕННЫХ регистрациях: " + СписокЗанятыхОтгрузок.Количество());
//	
//	
//	// ===================================================================
//	// ШАГ 4: Итоговая выборка доступных отгрузок
//	// (Проверяем: Документ.ОтгрузкаКлиенту, Продукция.Вес, условие Проведен)
//	// ===================================================================
//	
//	ТекстИсключения = "";
//	Если СписокЗанятыхОтгрузок.Количество() > 0 Тогда
//		ТекстИсключения = "И НЕ ОтгрузкаТЧ.Ссылка В (&СписокЗанятыхОтгрузок)";
//	КонецЕсли;
//	
//	ЗапросОтгрузки = Новый Запрос;
////	ЗапросОтгрузки.Текст = 
//	ЗапросОтгрузки.Текст = 
//		"ВЫБРАТЬ ПЕРВЫЕ 10
//		|	ОтгрузкаТЧ.Ссылка КАК Отгрузка,
//		|	ОтгрузкаТЧ.Ссылка.Клиент КАК Клиент,
//		|	ОтгрузкаТЧ.Количество КАК Количество,
//		|	ОтгрузкаТЧ.Продукция,
//		|	ОтгрузкаТЧ.Продукция.Вес КАК Вес
//		|ИЗ
//		|	Документ.ОтгрузкаКлиенту.Продукция КАК ОтгрузкаТЧ";
////		"ВЫБРАТЬ
////		|	ОтгрузкаТЧ.Ссылка КАК Отгрузка,
////		|	ОтгрузкаТЧ.Ссылка.Клиент КАК Клиент,
////		|	СУММА(ОтгрузкаТЧ.Количество * ЕСТЬNULL(ОтгрузкаТЧ.Продукция.Вес, 0)) КАК Вес
////		|ИЗ
////		|	Документ.ОтгрузкаКлиенту.Продукция КАК ОтгрузкаТЧ
////		|ГДЕ
////		|	ОтгрузкаТЧ.Ссылка.Проведен = ИСТИНА
//////		|	И ОтгрузкаТЧ.Ссылка.Клиент В (&СписокКлиентов)
//////		|	" + ТекстИсключения + "
////		|
////		|СГРУППИРОВАТЬ ПО
////		|	ОтгрузкаТЧ.Ссылка,
////		|	ОтгрузкаТЧ.Ссылка.Клиент
////		|
////		|УПОРЯДОЧИТЬ ПО
////		|	Клиент";
//	
//	ЗапросОтгрузки.УстановитьПараметр("СписокКлиентов", СписокКлиентов);
//	Если СписокЗанятыхОтгрузок.Количество() > 0 Тогда
//		ЗапросОтгрузки.УстановитьПараметр("СписокЗанятыхОтгрузок", СписокЗанятыхОтгрузок);
//	КонецЕсли;
//	
//	Результат = ЗапросОтгрузки.Выполнить();
//	
//	Если Не Результат.Пустой() Тогда
//		Выборка = Результат.Выбрать();
//		КоличествоСтрок = 0;
//		Пока Выборка.Следующий() Цикл
//			НоваяСтрока = Объект.ОтгрузкиКлиентам.Добавить();
//			НоваяСтрока.ОтгрузкаКлиенту = Выборка.Отгрузка;
//			НоваяСтрока.Вес = Выборка.Вес;
//			КоличествоСтрок = КоличествоСтрок + 1;
//		КонецЦикла;
//		Сообщить("4. Итоговое количество заполненных отгрузок: " + КоличествоСтрок);
//	Иначе
//		Сообщить("4. Итоговый запрос не вернул ни одной отгрузки. Проверьте данные (проведенные отгрузки, вес продукции).");
//	КонецЕсли;
//	
//	Сообщить("--- КОНЕЦ ОТЛАДКИ ---");
//	
//КонецПроцедуры
